# SelectableInViewFilter Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SelectableInViewFilter Constructor
SelectableInViewFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SelectableInViewFilter(Document, ElementId) | Constructs a new instance of an SelectableInViewFilter. |
| SelectableInViewFilter(Document, ElementId, Boolean) | Constructs a new instance of an SelectableInViewFilter, with the option to pass all non-selectable elements. |

# See Also
SelectableInViewFilter Class
SelectableInViewFilter Members
Autodesk.Revit.UI.Selection Namespace